app/controllers/calculator_controller.rb

  def find_armstrongs(arg)
      if arg == '' || arg.to_i.nil? || arg.to_i.zero?
          @result = 'There is no data or the data is incorrect'
          nil
      else
          @result = []
          ((10**(arg.to_i - 1))..(10**arg.to_i - 1)).each do |i|
              @result << i if armstrong_number?(i)
---
INSERT INTO "results" ("param", "res", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["param", "2"], ["res", "[]"], ["created_at", "2017-12-12 10:11:23.578067"], ["updated_at", "2017-12-12 10:11:23.578067"]]

  def output
    if Result.find_by(param: "#{@param}") == nil
---
SELECT  "results".* FROM "results" WHERE "results"."param" = ? LIMIT ?  [["param", "3"], ["LIMIT", 1]]